Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: Sometimes I employ a plastic surgeon. when the work was done, that´s when you saw us.
ru: Вот ей как раз мы сделали, и вы нас видели.

source: lt´s why her mom couldn´t l. D. her.
ru: Вот почему мать не могла её опознать.

source: Jesus fucking Christ!
ru: Господи.

source: No, Pierce Morehouse Patchett.
ru: Нет, мистер Уайт, меня зовут Пирс Морхаус Петчет.

source: I sense you´re on your best behavior, but that´s all l´m saying.
ru: Вы себя хорошо ведёте, но больше я вам ничего не скажу.

source: lf you persist, we´il meet with my attorney.
ru: Если настаиваете, встретимся с моим адвокатом.

source: would you like Lynn Bracken´s address?
ru: - Теперь хотите получить адрес мисс Брекен?

source: I got her address.
ru: Я думаю... - У меня есть адрес.

source: Find Susan´s killer, Mr. white.
ru: Найдите убийцу Сьюзен, мистер Уайт.

source: l´il give you a handsome reward.
ru: Я дам вам солидную награду.

source: whatever you desire!
ru: Всё, что пожелаете.

source: I know you´re not asleep.
ru: Ты говоришь со мной?

source: My 5 bucks.
ru: Мои 5 долларов.

source: It was the only one I had.
ru: Я понимаю.

source: Hey, doll face, tell him to leave us alone.
ru: О, детка, плохие новости.

source: Okay, fine.
ru: Ладно?

source: Oh, baby...... bad news.
ru: Всё будет хорошо, я тебе обещаю.

source: Go?
ru: Извини меня.

source: Something very important has come up and you have to go.
ru: Кто это, полиция?

source: l´il make it up to you.
ru: Мисс Брекен?

source: I will, I promise.
ru: Я офицер Уайт.

source: ls it the cops?
ru: Пирс звонил.

source: Miss Bracken...... l´m Officer white.
ru: Он рассказал мне про Сью.

source: l´ve been expecting you, just not this soon.
ru: Всё в порядке, куколка?

source: He told me what happened to Sue.
ru: Хочешь, чтобы я избавился от него?

source: Everything all right, doll? want me to get rid of him?
ru: Проваливай, приятель.

source: Hit the road.
ru: Может быть - да, может быть - нет.

source: LAPD.
ru: Полиция Л. А., засранец.

source: Get out of here or l´il have your wife come get you.
ru: Проваливай, или вызову твою жену, чтобы забрала тебя.

source: - Officer.
ru: - Офицер.

source: - Councilman.
ru: - Желаете выпить?

source: - would you care for a drink?
ru: - Да, скотч, чистый.

source: - Yeah, Scotch straight.
ru: - Вы знаете, о чём я?

source: I was friendly with Sue Lefferts, but we weren´t friends.
ru: - Вам жаль, что она погибла?

source: Know what I mean?
ru: Ну, конечно.

source: You sorry she´s dead?
ru: Что за вопрос.

source: Of course I am. what kind of question is that?
ru: Вы знаете, почему Пирс старается вас ублажить?

source: Do you know why Pierce is humoring you?
ru: Не произносите таких слов, я рассержусь.

source: Use words like that, you might make me mad.
ru: - Но, всё- таки, знаете?

source: But, do you know?
ru: - Да, знаю.

source: Patchett´s running whores...... cut to look like movie stars.
ru: Петчет торгует шлюхами, которые похожи на кинозвёзд.

source: And, judging by his address, something bigger on the side.
ru: И, судя по его адресу, чем- то ещё на стороне занимается.

source: He doesn´t want any attention.
ru: - Не хочет привлекать внимание.

source: That´s right.
ru: - Это верно.

source: Our motives are selfish so we´re cooperating.
ru: Наши мотивы эгоистичны.

source: So cooperate. why was Susan Lefferts at the Nite Owl?
ru: Почему Сьюзен Лефортс была в "Ночной сове"?

source: I don´t know.
ru: Я не знаю.

source: I never heard of the Nite Owl till today.
ru: Не слышала о "Ночной сове" до сегодня.

source: How´d she meet Patchett?
ru: - Как она познакомилась с Петчетом?

source: Pierce meets people.
ru: - Это он знакомится с людьми.

source: Sue had dreams of Hollywood and this is how they turned out.
ru: Сью мечтала о Голливуде, и вот чем закончилось.

source: Thanks to Pierce, we still get to act a little.
ru: Благодаря Пирсу нам доводится немного играть.

source: Tell me about Pierce.
ru: Расскажите мне о Пирсе.

source: He´s waiting for you to mention money.
ru: - Хотите совет, мисс Брекен?

source: want advice, Miss Bracken?
ru: - Зовите меня Лин.

source: Miss Bracken...... don´t ever try to fucking bribe me...... or l´il have you and Patchett in shit up to your ears.
ru: Мисс Брекен, никогда, чёрт, не пытайтесь меня подкупить или напугать.

source: I remember you from Christmas Eve.
ru: Я помню вас по Рождеству.

source: You have a thing for helping women, don´t you?
ru: У вас традиция помогать женщинам.

source: Maybe l´m just fucking curious.
ru: Не так ли, офицер Уайт?

source: - You say "fuck" a lot.
ru: - Может, я трахнутый от любопытства.

source: - You fuck for money.
ru: - Вам приходится трахаться многовато.

source: There´s blood on your shirt.
ru: - А вы трахаетесь за деньги.

source: An integral part of your job?
ru: - У вас кровь на рубашке.

source: - Do you enjoy it? when they deserve it.
ru: - И вам это нравится?

source: Did they deserve it today?
ru: - Когда они этого заслуживают.

source: l´m not sure.
ru: - Я не уверен.

source: - But you did it anyway.
ru: - Но вы всё равно их избили?

source: Like the half dozen guys you screwed today.
ru: А вы трахнулись с полдюжиной мужиков сегодня.

source: Actually, it was only two.
ru: Вообще- то, их было всего двое.

source: You´re different, Officer white.
ru: Вы не похожи на других полицейских, Уайт.

source: You´re the first man in years who didn´t tell me I look like Veronica Lake.
ru: Вы выглядите лучше, чем Вероника Лейт.

source: You look better than Veronica Lake.
ru: Так что с Петчетом?

source: He takes a cut of our earnings and invests it for us.
ru: Он забирает часть нашего заработка и вкладывает его для нас.

source: He doesn´t let us use narcotics and he doesn´t abuse us.
ru: Он не позволяет нам пользоваться наркотиками и не оскорбляет нас.

source: Can your policeman´s mentality grasp those contradictions?
ru: Ваша полицейская ментальность способна принять это противоречие?

source: He had you cut to look like Veronica Lake.
ru: - Вас тоже резали, чтобы вы были похожи на Веронику Лейт?

source: l´m really a brunette, but the rest is me.
ru: Я, вообще- то, брюнетка.

source: And that´s all the news that´s fit to print.
ru: А под платьем всё моё.

source: lt´s nice meeting you.
ru: Приятно было познакомиться, офицер.

source: - l´d like to see you again.
ru: - Я хотел бы увидеть вас снова.

source: - For a date...... or an appointment?
ru: - Вы просите о свидании или приёме?

source: - For a date, l´d know your first name.
ru: Если просите о свидании, я должна знать ваше имя...

source: It was a mistake.
ru: Забудьте, что я спрашивал.

source: Leonard Bidwell?
ru: Это была ошибка.

source: Come down here and talk to us.
ru: Леонард Фидвелл?

source: How´s the left these days? what´s it to you?
ru: Спуститесь, поговорим.

source: I saw you fight Kid Gavilan.
ru: - Как поживает твоя левая?

source: I like your style.
ru: - А вам- то что?

source: what do you want, Mr. Policeman?
ru: Что вам нужно, мистер полицейский?

source: You got a brother in Folsom.
ru: У тебя брат сидит в Фостере.

source: I put him there.
ru: Это я посадил его туда.

source: Until 1970.
ru: - До 1 970- го.

source: How´d you like to make it 1960?
ru: - Хочешь, это будет 1 960- й?

source: I know the judge, and Lieutenant Exley...... is good friends with the D. A. we´re looking for 3 colored guys who like to shoot shotguns.
ru: Я знаю судью, а лейтенант Эксли очень дружен с окружным прокурором.

source: One owns a maroon Mercury coupe. - want me to snitch? - want to buy your brother 10 years?
ru: - Хочешь подарить брату 1 0 лет?

source: - It was 10 years, right?
ru: - 1 0 лет?

source: - Yeah, 10 years.
ru: - Да, 1 0 лет.

source: You don´t have to say anything, just look at this list...... and point.
ru: Просто посмотри на этот список... и укажи.

source: He´s bad, so l´il just tell you.
ru: Он плохой, поэтому я вам лучше скажу.

source: Drives a maroon ´49 coupe.
ru: Шугар Рей Коллинз ездит на коричневом купе 49- го года.

source: Beautiful ride.
ru: Отличная машина.

source: Don´t know about shotguns, but he gets his thrills killing dogs.
ru: Не знаю насчёт ружей, но он тащится, убивая собак.

source: He´s righteous trash.
ru: Посмотри- ка сюда.

source: Look at that. lt´s five minutes from here.
ru: Это в 5 минутах отсюда.

source: l´il hear from you...... about my brother?
ru: Значит, вы сообщите мне, да?

source: Keep it up, Lenny.
ru: Перчатки, держи повыше.

source: There it is.
ru: Вот.

source: lt´s in the back.
ru: Это сзади.

source: - One of ours.
ru: - Один из наших.

source: - Shit, somebody beat us here!
ru: - Чёрт, нас опередили.

source: My glasses!
ru: - Что?

source: You´re kidding!
ru: - Мои очки.

source: well, just don´t shoot me.
ru: - Ты шутишь?

source: what are you doing here? we were in the neighborhood. - what do you got?
ru: Ребята, вы что тут делаете?

source: - Three 12- gauge pumps.
ru: Да были по соседству.

source: And cash.
ru: Что у вас?

source: Badge of Honor, here I come.
ru: Ну, прощай, полиция нравов.

source: This is our collar.
ru: - Пошёл ты, это наш арест!

source: l´m ranking officer here. we go as a team.
ru: Я старший офицер здесь.

source: Only one.
ru: Конец разговору.

source: Up the stairs.
ru: Да, ладно.

source: He´s very serious.
ru: - Сколько здесь дверей?

source: Don´t shoot!
ru: Полиция!

source: - Don´t move.
ru: - Чёрт, не стреляйте!

source: - Ace him, Jack!
ru: - Нет.

source: Anxious, aren´t you?
ru: - Не двигаться.

source: Don´t kill them.
ru: - Мочи их, Джек.

source: Back, back, back!
ru: Спокойно, сержант.

source: Get off me!
ru: Эй.

source: Against the wall!
ru: Назад, назад.

source: - Put your hands up!
ru: - Уйди от меня!

source: - Get over there.
ru: - К стене.

source: Hands behind your back!
ru: Руки за голову, живо.

source: So...... how´s it feel getting out of the office?
ru: Давай.

source: This came from forensics.
ru: Руки за спину!

source: Casitas Youth Camp.... "
ru: Ну как тебе выход из конторы?

source: lt´s crowded in here, white.
ru: Здесь слишком много народу, Уайт.

source: These guys killed Stensland.
ru: Эти ребята убили Стенсленда.

source: The ejection marks on the shells fired from the shotguns...... are identical to those on the shell casings found at the Nite Owl.
ru: Следы инжектора на гильзах, выпущенных из ружей подозреваемых...... совпадают с гильзами, найденными в "Ночной сове".

source: I want confessions, Edmund.
ru: Мне нужны признания.

source: A night´s stewing has softened them up.
ru: Ночь в камере, должно быть, размягчила их.

source: l´il break them, sir.
ru: Я их сломаю, сэр.

source: Are you sure golden boy is up to the task, Cap?
ru: Вы уверены, что наш золотой мальчик справится с заданием, капитан?

source: I think you´d be surprised what the lad is capable of.
ru: О, ты ещё удивишься, на что способен этот парень.

source: You´re 22.
ru: Тебе 22, так ведь, Рэй?

source: Did an officer work you over?
ru: Что, кто- нибудь из полицейских обработал тебя немножко?

source: - You´re 22, right? - why do you keep asking that?
ru: - Значит, тебе 22, так?

source: 22 makes it a gas chamber bounce.
ru: 22 - значит, ты уже годишься для газовой камеры.

source: You should´ve pulled this caper years ago.
ru: Получил бы пожизненное.

source: Get life, do a little Youth Authority jolt...... transfer to Folsom a big man...... get yourself a sissy....
ru: Отпилил бы год в молодёжке, перевели бы потом в Фолсен, как большого человека.

source: I don´t truck with no sissies.
ru: - Я не трахаю петушков.

source: Louis. what?
ru: Луис.

source: You did the Casitas Youth Camp with Louis. why you keep asking me about Louis?
ru: Зачем вы продолжаете спрашивать меня о Луисе?

source: His business is his business.
ru: Его дело - это его дело.

source: Sugar, Louis told me you went sissy up at Casitas.
ru: Шугар Луис рассказал мне, что ты опедерастился в Хаситосе.

source: You couldn´t do the time, so you got a big white boy to look after you.
ru: Потому что ты это делал так сладенько.

source: Said they called you "Sugar"...... because you gave it out so sweet.
ru: Луис опедерастился в Хаситосе, а я был бугром у нас в камере!

source: Louis gave it up at Casitas.
ru: Луис был петухом!

source: I was the boss jock in my dorm!
ru: За шоколадку делал это.

source: Louis was the sissy!
ru: Ума не больше, чем у собаки!

source: Louis gave it up for candy bars!
ru: Я знаю, ты любишь стрелять собак.

source: He ain´t got the sense of a dog!
ru: - Собакам нет причины жить.

source: You like to shoot dogs.
ru: - Ты к людям так же относишься?

source: Dogs got no reason to live.
ru: - Что ты пытаешься сказать?

source: Feel the same way about people? what´re you trying to say? we got the shotguns.
ru: - Да не было никаких ружей.

source: I don´t own no shotguns. why were you throwing clothes in the incinerator?
ru: А кто пытался одежду сжечь на заднем дворе?

source: Say what?
ru: Соседка.

source: A neighbor said she saw you throwing clothes in the incinerator.
ru: Говорит, видела, как ты пытался сжечь одежду во дворе.

source: Doesn´t look good.
ru: - Плохо твоё дело.

source: I ain´t talking till I see a judge. were you on hop?
ru: Ты ширялся.

source: You were passed out when we arrested you.
ru: Ты был в отрубе, когда мы тебя взяли.

source: Ty and Louis fuck with that shit, not me. where do they get their stuff?
ru: - Да Луис балуется этим дерьмом, не я!

source: Man....
ru: - Да?

source: Give me one to feed the D. A. lt´il make me look good...... and l´il say Sugar Ray´s not a punk like his sissy partners.
ru: Ну, давай, дай мне что- нибудь для прокурора.

source: Tell me one more thing about Jones and Fontaine. where do they get drugs?
ru: Ладно, Рей, расскажи- ка мне о Джонсе и Фонтейне.

source: Roland Navarette.
ru: Где они берут наркотики?

source: He runs a hole- up on Bunker Hill.
ru: У Роландо Наваретта.

source: And he sells red devils.
ru: У него хата на Паркен- Хилл, он торгует красными дьяволами.

source: Exley´s good, l´il give him that.
ru: Да, Эксли хорош, надо отдать ему должное.

source: l´il take a break.
ru: Ладно, перерыв.

source: You know, Ray, l´m talking about the gas chamber...... and you haven´t asked me what this is about.
ru: Знаешь, Рэй, я говорю о газовой камере, а ты даже не спросил меня, в чём дело.

source: You got a big "guilty" sign around your neck.
ru: "Виновен".

source: That was masterful, Edmund.
ru: Это был шедевр, Эдмонд.

source: Give Jones the newspaper.
ru: Этот готов сознаться.

source: I want him primed.
ru: Дайте Джонсу газету.

source: Take the cuffs off, so he can read it.
ru: Пусть подготовится.

source: Ray Collins just ratted you off.
ru: И снимите наручники, чтобы он мог её прочитать.

source: Said the Nite Owl was your idea.
ru: Рэй только что заложил тебя, сказав, что "Ночная сова" была твоей идеей.

source: I think it was Ray´s idea.
ru: Я думал, это была идея Рэя.

source: You talk, I think I can save your life.
ru: Ты говори.

source: 6 people are dead, and someone has to pay for it.
ru: Сынок, 6 человек убито.

source: Now, it can be you, or it can be Ray.
ru: Ну так это можешь быть ты, а может Рэй.

source: Louis, he called you queer.
ru: Луис, он назвал тебя педрилой.

source: - At Casitas, you took it up the ass.
ru: - Сказал, в Хаситосе каждый вставлял тебе в зад.

source: - I didn´t kill nobody!!
ru: - Я не убивал никого!

source: Son...... you know what´il happen if you don´t talk.
ru: Сынок...... Ты знаешь, что будет, если не заговоришь?

source: You´il go to the gas chamber.
ru: Пойдёшь в газовую камеру.

source: So admit what you did.
ru: Может, не придётся.

source: I didn´t mean to hurt her.
ru: Может, с ней всё в порядке.

source: - Maybe she´s okay.
ru: Всё в порядке?

source: They´re all in the morgue.
ru: Эти люди все в морге.

source: They were dead when you left them.
ru: Они были мертвы, когда ты ушёл.

source: I just wanted to lose my cherry.
ru: Луис, кто эта девушка?

source: She don´t die, so I don´t die.
ru: Как её зовут?

source: Louis, who´s the girl? what´s her name? who are you talking about? was she at the Nite Owl?
ru: Она что, была в "Ночной сове"?

source: Listen to me, was she at the Nite Owl?
ru: Луис, послушай меня, она была в "Ночной сове"?

source: - This paper shit ain´t shit! - where´s the girl?
ru: - Где девушка, о которой сказал Пантери?

source: You kill her?
ru: Ты убил её?

source: Louis lost his cherry, but things got out of hand.
ru: Ты хотел, чтобы Луис трахнулся, но ничего не вышло.

source: You made her bleed.
ru: И вы заставили её истекать кровью.

source: She bled on your clothes, so you burned the clothes. who said that?!
ru: - Кто это вам сказал?

source: Now, listen to me.
ru: Теперь послушай меня.

source: lf she´s alive, she´s the only chance you´ve got.
ru: - Я думаю, она жива!

source: - I think she´s alive.
ru: - Ты думаешь?

source: - You think? where is she now?
ru: Где она сейчас?

source: Did you leave her someplace?
ru: Вы где- то оставили её?

source: where is she?
ru: Говори, где она.

source: what´re you doing?!
ru: Быстро!

source: Don´t. white!
ru: Уайт!

source: 1 in 6! where´s the girl?!
ru: Говори, где она?

source: Put the weapon down! where´s the girl?!!
ru: Где девушка?

source: Sylvester Fitch, 109 Avalon...... brown corner house, upstairs.
ru: - Уайт, у меня всё под контролем!

source: - Just give me one minute.
ru: - Где девушка?

source: - You got it.
ru: Что?

source: Nobody moves. we´re going in the front.
ru: Эбонат- стрит, 1 09.

source: Stay put until I give the word.
ru: - Капитан, дайте мне одну минуту.

source: He went around back!
ru: - Ты её получил.

source: l´m Lieutenant Exley.
ru: Мисс, я лейтенант Эксли.

source: l´m sorry to ask you this.
ru: Простите, что я спрашиваю.

source: I need to know when they left you.
ru: Мне надо знать, когда они вас оставили.

source: Get her to the hospital.
ru: - Отвезите её в больницу.

source: Give your career a rest.
ru: - Я понимаю, что трудно...

source: Leave her alone.
ru: Оставь её в покое.

source: A naked guy with a gun? who´il believe that?
ru: Голый парень с пистолетом?

source: Get the fuck away from me.
ru: Ожидаешь, что тебе кто- то поверит?

source: How´il it look in your report?
ru: Отстань нахрен от меня.

source: lt´il look like justice.
ru: - Как это будет выглядеть в твоём рапорте?

source: That´s what the man got.
ru: Вот что он получил.

source: Justice.
ru: Да?

source: You don´t know the meaning of the word.
ru: А ты думаешь, это означает твою фотографию в газете.

source: Go after criminals for a change.
ru: Занялся бы преступниками, а не полицейскими.

source: Stensland got what he deserved and so will you.
ru: Стенсленд получил, что заслуживал.

source: lt´s best to stay away when his blood is up.
ru: Лучше держаться от него подальше, когда у него кровь кипит.

source: His blood´s always up.
ru: У него всегда кровь кипит.

source: Perhaps you should stay away from him altogether.
ru: Может, тебе лучше всегда от него держаться подальше?

source: Raymond Collins, Ty Jones and Louis Fontaine.
ru: Рейбек Полин, Тай Джонс и Луис Фонтейн.

source: They are considered armed and dangerous.
ru: Все они считаются вооружёнными и опасными.

source: The Nite Owl suspects have escaped.
ru: Повторяю: подозреваемые в убийстве в "Ночной сове" совершили побег.

source: How´d they get out the window?
ru: Как они выбрались из окна?

source: They jumped from the 2nd floor.
ru: Спрыгнули со второго этажа.

source: Girl said they left her at 12.
ru: Девушка говорит, они оставили её в 1 2.

source: They could get to the Nite Owl by 1.
ru: Могли к часу приехать в "Ночную сову".

source: The question was, where did they get their drugs?
ru: Вопрос в том, где они взяли наркотики.

source: I haven´t gotten that far yet.
ru: Я до этого ещё не дошла.

source: "Roland Navarette lives on Bunker Hill, runs a hole- up --"
ru: - Что- нибудь случилось, лейтенант?

source: Anyone seen Jack Vincennes?
ru: - Мне нужна поддержка.

source: ls something up?
ru: Пошли.

source: I need some backup.
ru: - Что?

source: - Nothing.
ru: - Ничего, пошли.

source: You´re under arrest.
ru: Никому не двигаться!

source: Don´t shoot, man!
ru: - Оставаться на местах.

source: Don´t move!
ru: Вы арестованы.

source: You did good, kid.
ru: Ты хорошо поработал, парень.

source: You should´ve seen this place.
ru: Ну и вид у тебя, кругом кровь.

source: Shotgun Ed.
ru: Кто бы мог подумать, а, стрелок?

source: Somebody get him cleaned up.
ru: - Приведите его в порядок.

source: Edmund J. Exley has amassed a brilliant record...... in his 7 years with the Los Angeles Police Department.
ru: Эдмонд Джей Эксли, человек с безупречным послужным списком...... за все 7 лет работы в управлении полиции города Лос- Анджелеса.

source: Recently, he evinced spectacular bravery in the line of duty.
ru: Недавно он проявил чудеса храбрости при выполнении служебного долга.

source: It is our privilege to present him with our highest honor:
ru: И мы награждаем его высокой наградой.

source: The Medal of Valor. - what kind of car was it?
ru: - Это мой "форд".

source: - It was a Ford.
ru: - Вы уверены?

source: I know what they look like.
ru: - Мой муж всегда ездил на "форде".

source: Excuse me, ma´am.
ru: Он нравился ему.

source: Light or dark?
ru: Осветим темноту.

source: Light.
ru: Осветим?

source: And that´s really all I remember, Officer.
ru: Это всё, что я, действительно, помню, офицер.

source: You´ve been a big help.
ru: Вы нам очень помогли.

source: Cut!
ru: Снято!

source: That´s a print.
ru: Это блестяще.

source: Big Jack!
ru: Эй, Большой Джек!

source: He´s back!
ru: - Он вернулся.

source: Jack´s back.
ru: - Эй, Джек вернулся.

source: Tell Mr. Patchett I have no intention of changing my vote.
ru: Скажите мистеру Петчету, я не собираюсь менять своё решение по голосованию.

source: It may surprise some that an official would admit to making a mistake...... but after due consideration...... l am changing my position on the matter before the council.
ru: Некоторых может удивить, что человек, занимающий центральный пост...... признаётся в ошибке.

source: "Go west, America," was a slogan of Manifest Destiny.
ru: Без светофоров, без запретительных знаков.

source: Today is that last step westward with no stop signs...... no traffic signals, from downtown...... to the beach in 20 minutes.
ru: Из центра на побережье за 20 минут!

source: what were you going to start with?
ru: Ну, с чего ты начнёшь?

source: Gambling?
ru: С проституции?

source: Go back to Jersey, sonny.
ru: С игорного бизнеса?

source: This is the City of the Angels...... and you haven´t got any wings.
ru: Это "Город ангелов", а у тебя нет крыльев.

source: Nice to see you again.
ru: Рада была вас видеть.

source: I wondered when you´d knock on my door again, Officer white.
ru: Я всё ждала, когда вы снова постучитесь ко мне, офицер Уайт.

source: lt´s Bud.
ru: Зови меня Бад.

source: Bud.
ru: Бад.

source: why me?
ru: Почему я?

source: This election...... is about the future of law enforcement in Los Angeles.
ru: Эти выборы определят будущее правопорядка в Лос- Анджелесе.

source: City Councilman Rogers represents that future.
ru: Городской советник Роджерс.

source: So let´s dig deep...... and get a moral man re- elected.
ru: Давайте же залезем поглубже в свои карманы и изберём нравственного человека.

source: Ellis Loew wants to say a few words.
ru: Элис Леу хочет сказать несколько слов.

source: Thank you, Brett Chase.
ru: Спасибо.

source: The talented star of Badge of Honor.
ru: Спасибо, Брэд Чейс, наша талантливая звезда "Знака чести".

source: Let me tell you, I am so thrilled to be here.
ru: Большой Джек!

source: Big V.
ru: Джеки!

source: Good to see you back.
ru: Рад, что ты вернулся, бой Джек.

source: - How they hanging, Sid?
ru: - Ну как у тебя висит, Сид?
